# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# t = ["X", "Y"]
# a = []
# for i in range(2):
#     a.append(input(f"Введите координатy {t[i]} точки A: "))

x1 = int(input('Введите координатy X точки A: '))
y1 = int(input('Введите координатy Y точки A: '))

x2 = int(input('Введите координатy X точки B: '))
y2 = int(input('Введите координатy Y точки B: '))

# print(round(((x2-int(a[0]))**2+(y2-int(a[1]))**2)**(0.5), 2))

print(round(float(((x2-x1)**2+(y2-y1)**2)**(0.5)), 2))